## Technical Workshop

- Team up and apply the concepts that you have learned in pandas to access, manipulate and analyze data
- Tinker around with the dataset to answer a series of questions
- Save your group notebook and submit with the following format: `workshop_group_<#>.ipynb`
- Duration: 1 hour

### Olympics Agency

You and your teammates are working in the Data Science department of a renowned Sports Agency that primarily focuses on the Olympics. Consultants and journalists reach out to your team for key insights to fulfill their upcoming prints and marketing stints.

Thankfully you have access to the relevant dataset, and of course your newly acquired Python Pandas skills.

#### Available Datasets

| **Dataset**      | **Notes**      |
| ------------- | ------------- |
| [olympics_bios.csv](data/olympics_bios.csv) | Contains basic biographical data of Olympians since 1960s |
| [noc_regions.csv](data/noc_regions.csv) | Contains records of National Olympic Committees |
| [olympics_results.csv](data/olympics_results.csv) | Contains all records of Olympic events and the corresponding results |

In [6]:
import pandas as pd

olympics_bios = pd.read_csv('./data/olympics_bios.csv')
noc = pd.read_csv('./data/noc_regions.csv')
olympics_results = pd.read_csv('./data/olympics_results.csv')

In [7]:
olympics_bios.sample(5)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
114049,115353,Moukheld Al-Outaibi,1976-06-20,Taif,Makkah,KSA,Kingdom of Saudi Arabia,163.0,60.0,NaN
111007,112237,Jonas Andersson,1984-02-06,NaN,NaN,NaN,Sweden,176.0,73.0,NaN
37007,37302,Graham Fisk,1928-02-05,Sydney,New South Wales,AUS,Great Britain,NaN,NaN,2008-06-07
75918,76501,Mwinga Mwanjala,1960-01-13,NaN,NaN,NaN,United Republic of Tanzania,154.0,54.0,NaN
71380,71919,Daciano Colbachini,1893-10-31,Padova,Padova,ITA,Italy,NaN,NaN,1982-04-13

In [8]:
noc.sample(5)

     NOC                 region notes
19   BEL                Belgium   NaN
188  STP  Sao Tome and Principe   NaN
109  KOR            South Korea   NaN
103  JOR                 Jordan   NaN
3    ALG                Algeria   NaN

In [9]:
olympics_results.sample(5)

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
35050,1972.0,Summer,Hockey,"Hockey, Men (Olympic)",Yang Siow Ming,19642,MAS,Malaysia,8.0,False,NaN
253633,2008.0,Summer,Rowing,"Eights, Women (Olympic)",Christina Hennings,117988,GER,Germany,7.0,False,NaN
39902,1984.0,Summer,Fencing,"Épée, Team, Men (Olympic)",Philippe Boisse,21739,FRA,France,2.0,False,Silver
131954,1972.0,Summer,Sailing,"Three Person Keelboat, Open (Olympic)",Steve Marten,62911,NZL,New Zealand,21.0,False,NaN
115033,1968.0,Summer,Swimming (Aquatics),"4 × 100 metres Medley Relay, Men (Olympic)",Ken Walsh,51607,USA,United States,1.0,False,Gold

#### I. Filipino Sporting Triumphs

The Filipino Olympic Committee has commissioned our agency to highlight their athletic achievements since the turn of the millennium. Your task is to compile a list of unique sports disciplines where Pinoy athletes have left their mark since the year 2000. Moreover, which amongst these sports disciplines did they produce promising results in (i.e bagged any type of medals)?

#### II. The Big Five

Sports journalists are crafting a new magazine that features __*"The Big Five"*__. They reached out your team seeking information on the global power rankings in Olympic history. What are the top 5 countries that bagged the most Gold medals?

#### III. BMI Influence in Medal Success

General coaching staff from various professional athelete management firms seek to understand correlation of body composition and performance outcome in a given field of sports. Your team was asked to provide data on the average BMI of gold medalists per discipline.

> Use the formula BMI = weight (kg) / (height (m) ^ 2) to calculate BMI